#+AUTHOR: Neal Haas
#+STARTUP: content

** LSP Mode
Super key 's-' keybindings don't really work over PuTTY. I found this article on
StackOverflow with a similar issue:
https://emacs.stackexchange.com/questions/55199/what-are-these-prefix-commands-that-start-with-s-l

#+BEGIN_SRC emacs-lisp
  ;; (setq lsp-keymap-prefix "C-c C-l")
  ;; (global-set-key (kbd "C-c C-l") 'lsp-keymap-prefix)
  ;; (define-key evil-normal-state-map (kbd "l") '(kbd "C-x @ s l"))
  ;; (define-key evil-normal-state-map (kbd "g l") event-apply-super-modifier)
  ;; (define-key evil-normal-state-map (kbd "g s") '(kbd "C-x @ s"))
  ;; (define-key evil-normal-state-map (kbd "g s") help-map))
  ;; (global-set-key (kbd "C-c C-s") (lookup-key global-map (kbd "C-x @ s")))
#+END_SRC

#+RESULTS:
: 2

** Other
#+BEGIN_SRC emacs-lisp
  ;; SSG team does not want makefiles or SCons to have tabs
  ;; (add-hook 'before-save-hook (lambda () (untabify (point-min) (point-max))))
  (add-hook 'before-save-hook 'untabify-except-makefiles)
  ;; (add-hook 'before-save-hook 'untabify-except-python)
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  (add-hook 'sh-set-shell-hook #'my/tcsh-set-indent-functions)
  (add-hook 'dired-mode-hook 'my-dired-mode-setup)
#+END_SRC

Not sure where to put this. SCons scripts use Python syntax
#+BEGIN_SRC emacs-lisp
  ;; add several elements at the end (may create double entries,
  ;; but that would not hurt)
  (setq auto-mode-alist
        (append auto-mode-alist
                '(("SConstruct" . python-mode)
                  ("SConscript" . python-mode))))

  ;; (setq auto-mode-alist
  ;;       (cons '("SConstruct" . python-mode) auto-mode-alist)
  ;;       (cons '("SConscript" . python-mode) auto-mode-alist))
#+END_SRC

For some reason python-mode overrides the default offset of 4 to 8. I can't find
where that is happening, but this is working
#+BEGIN_SRC emacs-lisp
  (add-hook 'python-mode-hook
        (lambda ()
          (setq indent-tabs-mode t)
          (setq tab-width 4)
          (setq python-indent-offset 4)))
#+END_SRC

#+RESULTS:
| lambda | nil | (setq indent-tabs-mode t) | (setq tab-width 4) | (setq python-indent-offset 4) |

